Revit 2027 API
ColorPreset Enumeration
 Preset values of initial colors for specific lighting types
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ColorPreset
Public Enumeration ColorPreset
public enum class ColorPreset
type ColorPreset
Members
Member name | Value | Description
D50 | 1 |  D50.
D65 | 0 |  D65.
FluorescentCool | 7 |  F4 fluorescent cool white.
FluorescentDayLight | 9 |  F4 fluorescent day light.
FluorescentLightWhite | 10 |  F4 fluorescent light white.
FluorescentWarm | 6 |  F4 fluorescent warm white.
FluorescentWhite | 8 |  F4 fluorescent white.
Halogen | 2 |  Halogen.
HighPressureSodium | 12 |  High pressure sodium.
Incandescent | 3 |  Incandescent.
LowPressureSodium | 13 |  Low pressure sodium.
Mercury | 14 |  Mercury.
MetalHalide | 11 |  Metal halide.
PhosphorMercury | 15 |  Phosphor mercury.
Quartz | 5 |  Quartz.
Xenon | 4 |  Xenon.
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace